Repository: Imran200216/social_manager_app
Catalog: lib/l10n/app_*.arb
Languages: ar, de, hi, ja, ru

# onBoardingTitleOne
source: Smarter Networking like a King
ar: شبكات أذكى كأنك ملك
de: Intelligenteres Networking wie ein König
hi: किंग की तरह स्मार्ट नेटवर्किंग
ja: 王のようにスマートなネットワーキング
ru: Умный нетворкинг как у короля

# onBoardingDescriptionOne
source: Exchange socials seamlessly and grow your network effortlessly, anytime, anywhere.
ar: تبادل حساباتك الاجتماعية بسهولة ووسّع شبكتك في أي وقت وأي مكان.
de: Tauschen Sie soziale Profile mühelos aus und erweitern Sie Ihr Netzwerk jederzeit und überall.
hi: सोशल लिंक आसानी से साझा करें और कहीं भी, कभी भी अपना नेटवर्क बढ़ाएँ।
ja: ソーシャルリンクをシームレスに交換し、いつでもどこでも手軽にネットワークを広げましょう。
ru: Обменивайтесь социальными сетями без труда и развивайте свою сеть в любое время и в любом месте.

# onBoardingTitleTwo
source: Connect Instantly
ar: اتصل فورًا
de: Sofort verbinden
hi: तुरंत कनेक्ट करें
ja: すぐに接続
ru: Мгновенное подключение

# onBoardingDescriptionTwo
source: Scan QR codes and connect with people in seconds.
ar: امسح رمز QR واتصل بالآخرين خلال ثوانٍ.
de: Scannen Sie QR-Codes und verbinden Sie sich in wenigen Sekunden mit Menschen.
hi: QR कोड स्कैन करें और कुछ ही सेकंड में लोगों से जुड़ें।
ja: QRコードをスキャンして、数秒で人とつながることができます。
ru: Сканируйте QR-коды и подключайтесь к людям за считанные секунды.

# onBoardingTitleThree
source: Share Socials Easily
ar: شارك حساباتك بسهولة
de: Soziale Profile leicht teilen
hi: सोशल लिंक आसानी से साझा करें
ja: ソーシャルを簡単に共有
ru: Легко делитесь соцсетями

# onBoardingDescriptionThree
source: Add unlimited social links and share them anytime
ar: أضف روابط اجتماعية غير محدودة وشاركها في أي وقت.
de: Fügen Sie unbegrenzt soziale Links hinzu und teilen Sie sie jederzeit.
hi: अनलिमिटेड सोशल लिंक जोड़ें और कभी भी साझा करें।
ja: 無制限にソーシャルリンクを追加し、いつでも共有できます。
ru: Добавляйте неограниченное количество ссылок и делитесь ими в любое время.

source: Skip
ar: تخطّي
de: Überspringen
hi: स्किप
ja: スキップ
ru: Пропустить

source: Next
ar: التالي
de: Weiter
hi: आगे
ja: 次へ
ru: Далее

source: Get Started
ar: ابدأ
de: Loslegen
hi: शुरू करें
ja: 開始
ru: Начать

source: Enable passkeys
ar: تفعيل مفاتيح المرور
de: Passkeys aktivieren
hi: पासकी सक्षम करें
ja: パスキーを有効にする
ru: Включить Passkeys

# enablePasskeysDescription
source: Use your face os fingerprint t verify it's you. No Password required
ar: استخدم وجهك أو بصمتك للتحقق من هويتك. بدون الحاجة إلى كلمة مرور.
de: Verwenden Sie Gesicht oder Fingerabdruck, um Ihre Identität zu bestätigen. Kein Passwort erforderlich.
hi: अपने चेहरे या फिंगरप्रिंट से पहचान की पुष्टि करें। पासवर्ड की ज़रूरत नहीं।
ja: 顔認証または指紋で本人確認。パスワードは不要です。
ru: Используйте лицо или отпечаток пальца, чтобы подтвердить свою личность. Пароль не требуется.

source: Continue with Google
ar: المتابعة باستخدام Google
de: Mit Google fortfahren
hi: Google से जारी रखें
ja: Googleで続行
ru: Продолжить с Google

source: Continue with Apple
ar: المتابعة باستخدام Apple
de: Mit Apple fortfahren
hi: Apple से जारी रखें
ja: Appleで続行
ru: Продолжить с Apple

# termsPara
source: By continuing, you confirm that you've read and agreed to the
ar: بالمتابعة، أنت تؤكد أنك قرأت ووافقت على
de: Indem Sie fortfahren, bestätigen Sie, dass Sie gelesen haben und einverstanden sind mit den
hi: जारी रखते हुए, आप पुष्टि करते हैं कि आपने पढ़ा है और सहमत हैं
ja: 続行すると、あなたが以下を読み、同意したことを確認します
ru: Продолжая, вы подтверждаете, что прочитали и согласны с

source: Terms of Service
ar: شروط الخدمة
de: Nutzungsbedingungen
hi: सेवा की शर्तें
ja: 利用規約
ru: Условиями обслуживания

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
hi: गोपनीयता नीति
ja: プライバシーポリシー
ru: Политикой конфиденциальности

# termsConsent
source: and consent to the
ar: و توافق على
de: und stimmen der
hi: और सहमति देते हैं
ja: に同意し、 承諾します
ru: и даёте согласие на

source: Personal Info
ar: المعلومات الشخصية
de: Persönliche Informationen
hi: व्यक्तिगत जानकारी
ja: 個人情報
ru: Личная информация

# personalInfoDescription
source: Manage your basic details
ar: إدارة تفاصيلك الأساسية
de: Verwalten Sie Ihre grundlegenden Angaben
hi: अपनी बुनियादी जानकारी प्रबंधित करें
ja: 基本情報を管理します
ru: Управляйте основными данными

source: Share App
ar: مشاركة التطبيق
de: App teilen
hi: ऐप साझा करें
ja: アプリを共有
ru: Поделиться приложением

# shareAppDescription
source: Let others discover this app
ar: دع الآخرين يكتشفون هذا التطبيق
de: Lassen Sie andere diese App entdecken
hi: दूसरों को इस ऐप के बारे में बताएं
ja: 他の人にこのアプリを紹介しましょう
ru: Позвольте другим узнать об этом приложении

# faq
source: FAQ's
ar: الأسئلة الشائعة
de: FAQ
hi: अक्सर पूछे जाने वाले प्रश्न
ja: FAQ
ru: FAQ

# faqDescription
source: Learn more about the app
ar: تعرّف على المزيد حول التطبيق
de: Erfahren Sie mehr über die App
hi: ऐप के बारे में और जानें
ja: アプリについて詳しく知る
ru: Узнайте больше о приложении

source: Contact Support
ar: اتصل بالدعم
de: Support kontaktieren
hi: सहायता से संपर्क करें
ja: サポートに連絡
ru: Связаться с поддержкой

# contactSupportDescription
source: Reach out for any support
ar: تواصل للحصول على أي مساعدة
de: Kontaktieren Sie uns für jegliche Unterstützung
hi: किसी भी सहायता के लिए संपर्क करें
ja: サポートが必要な場合はこちら
ru: Получите помощь по любому вопросу

source: Logout
ar: تسجيل الخروج
de: Abmelden
hi: लॉग आउट
ja: ログアウト
ru: Выйти

# logoutDescription
source: Reach out for any support
ar: تسجيل الخروج من الحساب
de: Melden Sie sich von Ihrem Konto ab
hi: खाते से लॉग आउट करें
ja: アカウントからログアウトします
ru: Выйдите из аккаунта

source: Home
ar: الصفحة الرئيسية
de: Startseite
hi: होम
ja: ホーム
ru: Главная

source: Profile
ar: الملف الشخصي
de: Profil
hi: प्रोफ़ाइल
ja: プロフィール
ru: Профиль

source: Connections
ar: الاتصالات
de: Kontakte
hi: कनेक्शंस
ja: つながり
ru: Контакты

source: Scan
ar: مسح
de: Scannen
hi: स्कैन
ja: スキャン
ru: Сканировать

# privacyPolicyDescription
source: Know how we use and secure your data
ar: تعرف على كيفية استخدام بياناتك وتأمينها
de: Erfahren Sie, wie wir Ihre Daten nutzen und schützen
hi: जानें कि हम आपके डेटा का उपयोग और उसे सुरक्षित कैसे करते हैं
ja: データの使用方法と保護方法をご確認ください
ru: Узнайте, как мы используем и защищаем ваши данные

source: Language Preference
ar: تفضيل اللغة
de: Sprachpräferenz
hi: भाषा वरीयता
ja: 言語設定
ru: Предпочтения языка

# languagePreferenceDescription
source: Manage your app’s language settings
ar: إدارة إعدادات لغة التطبيق
de: Verwalten Sie die Spracheinstellungen der App
hi: अपने ऐप की भाषा सेटिंग्स प्रबंधित करें
ja: アプリの言語を管理します
ru: Управляйте языковыми настройками приложения

source: Choose your language
ar: اختر لغتك
de: Wählen Sie Ihre Sprache
hi: अपनी भाषा चुनें
ja: 言語を選択
ru: Выберите язык

# chooseYourLanguageDescription
source: Pick your desired app language and enjoy a smoother, more personalized start.
ar: اختر لغة التطبيق التي تناسبك واستمتع بتجربة أكثر سلاسة وتخصيصًا.
de: Wählen Sie Ihre bevorzugte App-Sprache und genießen Sie einen personalisierten Start.
hi: अपनी पसंदीदा ऐप भाषा चुनें और एक सहज व व्यक्तिगत अनुभव पाएं।
ja: 希望のアプリ言語を選択して、よりスムーズで個別化された体験をお楽しみください。
ru: Выберите язык приложения и наслаждайтесь более удобным, персонализированным интерфейсом.

source: Scan QR Code
ar: مسح رمز الاستجابة السريعة
de: QR-Code scannen
hi: क्यूआर कोड स्कैन करें
ja: QRコードをスキャン
ru: Сканировать QR-код

# scanQRCodeTitle
source: Align the QR Code Inside the Frame
ar: ضع رمز الاستجابة السريعة داخل الإطار
de: Richten Sie den QR-Code in der Mitte des Rahmens aus
hi: QR कोड को फ़्रेम के अंदर संरेखित करें
ja: QRコードを枠内に合わせてください
ru: Разместите QR-код внутри рамки

# scanQRCodeSubTitle
source: Keep your device steady and ensure the QR code is fully visible for best results.
ar: أمسك جهازك بثبات وتأكد من أن رمز الاستجابة السريعة مرئي بالكامل للحصول على أفضل النتائج.
de: Halten Sie Ihr Gerät ruhig und stellen Sie sicher, dass der QR-Code vollständig sichtbar ist.
hi: अपना डिवाइस स्थिर रखें और सुनिश्चित करें कि QR कोड पूरी तरह दिखाई दे ताकि सर्वोत्तम परिणाम मिल सकें।
ja: 端末をしっかり持ち、QRコード全体が視界に入るようにしてください。
ru: Держите устройство неподвижно и убедитесь, что QR-код полностью в кадре.

# scanQRLightningSetup
source: Use good lighting to improve detection and scanning speed.
ar: استخدم إضاءة جيدة لتحسين سرعة ودقة المسح.
de: Nutzen Sie eine gute Beleuchtung für bessere Erkennung und schnellere Scans.
hi: बेहतर पहचान और तेज़ स्कैनिंग के लिए अच्छी रोशनी का उपयोग करें।
ja: 良い照明でスキャン精度と速度を向上させましょう。
ru: Используйте хорошее освещение для улучшения распознавания и скорости сканирования.

source: Your Connections
ar: جهات الاتصال الخاصة بك
de: Ihre Kontakte
hi: आपके कनेक्शन
ja: あなたのつながり
ru: Ваши контакты

# noConnectionsFound
source: No Connections added yet. Please can your friends add you as a connection.
ar: لم يتم إضافة أي جهات اتصال بعد. يرجى طلب من أصدقائك إضافتك كجهة اتصال.
de: Noch keine Kontakte hinzugefügt. Bitten Sie Ihre Freunde, Sie hinzuzufügen.
hi: अभी तक कोई कनेक्शन नहीं जोड़ा गया है। कृपया अपने मित्रों से आपको कनेक्शन के रूप में जोड़ने के लिए कहें।
ja: まだつながりがありません。友達にあなたを追加してもらってください。
ru: Пока нет добавленных контактов. Попросите друзей добавить вас.

source: Your Digital Card
ar: بطاقتك الرقمية
de: Ihre digitale Karte
hi: आपका डिजिटल कार्ड
ja: あなたのデジタルカード
ru: Ваша цифровая карта

# noDigitalCardFound
source: You don’t have a digital card yet. Add your details under Personal Info to create one.
ar: ليس لديك بطاقة رقمية بعد. أضف معلوماتك في قسم المعلومات الشخصية لإنشائها.
de: Sie haben noch keine digitale Karte. Fügen Sie Ihre Details unter Persönliche Informationen hinzu, um eine zu erstellen.
hi: आपका डिजिटल कार्ड अभी तैयार नहीं है। इसे बनाने के लिए अपनी प्रोफ़ाइल में 'पर्सनल इंफो' विवरण जोड़ें।
ja: まだデジタルカードがありません。個人情報から詳細を追加して作成しましょう。
ru: У вас ещё нет цифровой карты. Добавьте свои данные в разделе «Личная информация», чтобы создать её.

source: DigiCard
ar: بطاقة رقمية
hi: डिजीकार्ड
ja: デジカード

source: Search connections...
ar: ابحث عن جهات الاتصال...
de: Kontakte suchen...
hi: कनेक्शन खोजें...
ja: つながりを検索…
ru: Поиск контактов...

source: Good Morning
ar: صباح الخير
de: Guten Morgen
hi: सुप्रभात
ja: おはようございます
ru: Доброе утро

source: Good Afternoon
ar: مساء الخير
de: Guten Nachmittag
hi: नमस्कार
ja: こんにちは
ru: Добрый день

source: Good Evening
ar: مساء الخير
de: Guten Abend
hi: शुभ संध्या
ja: こんばんは
ru: Добрый вечер

source: hi
ar: مرحبا
de: Hallo
hi: हाय
ja: こんにちは
ru: Привет

source: Total Impression
ar: إجمالي الانطباعات
de: Gesamte Impressionen
hi: कुल इंप्रेशन
ja: 総インプレッション
ru: Всего впечатлений

source: Add Links
ar: أضف الروابط
de: Links hinzufügen
hi: लिंक जोड़ें
ja: リンクを追加
ru: Добавить ссылки

source: Total Views
ar: إجمالي المشاهدات
de: Gesamtansichten
hi: कुल दृश्य
ja: 総閲覧数
ru: Всего просмотров

source: Total Connections
ar: إجمالي الاتصالات
de: Gesamtanzahl der Kontakte
hi: कुल कनेक्शन
ja: 総つながり数
ru: Всего контактов

source: Total Links Added
ar: إجمالي الروابط المضافة
de: Gesamtanzahl hinzugefügter Links
hi: जोड़े गए कुल लिंक
ja: 追加されたリンク総数
ru: Всего добавленных ссылок

source: First Name
ar: الاسم الأول
de: Vorname
hi: पहला नाम
ja: 名
ru: Имя

source: Enter first name
ar: أدخل الاسم الأول
de: Vornamen eingeben
hi: पहला नाम दर्ज करें
ja: 名を入力
ru: Введите имя

source: Last Name
ar: اسم العائلة
de: Nachname
hi: अंतिम नाम
ja: 姓
ru: Фамилия

source: Enter last name
ar: أدخل اسم العائلة
de: Nachnamen eingeben
hi: अंतिम नाम दर्ज करें
ja: 姓を入力
ru: Введите фамилию

source: Bio
ar: السيرة
de: Biografie
hi: बायो
ja: 自己紹介
ru: Био

source: Enter bio
ar: أدخل السيرة
de: Biografie eingeben
hi: बायो दर्ज करें
ja: 自己紹介を入力
ru: Введите описание

source: cannot be empty
ar: لا يمكن أن يكون فارغًا
de: darf nicht leer sein
hi: खाली नहीं हो सकता
ja: 空欄にはできません
ru: не может быть пустым

source: Optional
ar: اختياري
hi: वैकल्पिक
ja: 任意
ru: Необязательно

source: About You
ar: عنك
de: Über Sie
hi: आपके बारे में
ja: あなたについて
ru: О вас

source: Save
ar: حفظ
de: Speichern
hi: सहेजें
ja: 保存
ru: Сохранить

source: Profile Views
ar: مشاهدات الملف الشخصي
de: Profilansichten
hi: प्रोफ़ाइल दृश्य
ja: プロフィール閲覧数
ru: Просмотры профиля

# profileViewsDescription
source: Track recent visits to your profile
ar: تتبع الزيارات الأخيرة لملفك الشخصي
de: Verfolgen Sie die neuesten Aufrufe Ihres Profils
hi: अपने प्रोफ़ाइल पर हाल की विज़िट को ट्रैक करें
ja: 最近あなたのプロフィールを閲覧した人を追跡します
ru: Отслеживайте недавние посещения вашего профиля

source: Add More Social Profiles
ar: أضف المزيد من الملفات الاجتماعية
de: Weitere soziale Profile hinzufügen
hi: अधिक सोशल प्रोफ़ाइल जोड़ें
ja: ソーシャルプロフィールを追加
ru: Добавить больше соцпрофилей

source: UserName
ar: اسم المستخدم
de: Benutzername
hi: उपयोगकर्ता नाम
ja: ユーザー名
ru: Имя пользователя

source: Enter user name
ar: أدخل اسم المستخدم
de: Benutzernamen eingeben
hi: उपयोगकर्ता नाम दर्ज करें
ja: ユーザー名を入力
ru: Введите имя пользователя

source: Social Profile URL
ar: رابط الملف الاجتماعي
de: URL des sozialen Profils
hi: सोशल प्रोफ़ाइल URL
ja: ソーシャルプロフィールURL
ru: URL профиля

source: Clear
ar: مسح
de: Löschen
hi: साफ़ करें
ja: クリア
ru: Очистить

source: Add Social Profile
ar: إضافة ملف اجتماعي
de: Soziales Profil hinzufügen
hi: सोशल प्रोफ़ाइल जोड़ें
ja: ソーシャルプロフィールを追加
ru: Добавить соцпрофиль

source: Enter Social Profile URL
ar: أدخل رابط الملف الاجتماعي
de: URL des sozialen Profils eingeben
hi: सोशल प्रोफ़ाइल URL दर्ज करें
ja: ソーシャルプロフィールURLを入力
ru: Введите URL соцпрофиля

source: Display Name
ar: اسم العرض
de: Anzeigename
hi: प्रदर्शित नाम
ja: 表示名
ru: Отображаемое имя

source: Use Username
ar: استخدم اسم المستخدم
de: Benutzernamen verwenden
hi: यूज़रनेम का उपयोग करें
ja: ユーザー名を使用
ru: Использовать имя пользователя

source: Use Url
ar: استخدم الرابط
de: URL verwenden
hi: URL का उपयोग करें
ja: URLを使用
ru: Использовать URL

source: Select Social Platform
ar: اختر المنصة الاجتماعية
de: Soziale Plattform auswählen
hi: सोशल प्लेटफ़ॉर्म चुनें
ja: ソーシャルプラットフォームを選択
ru: Выберите социальную платформу
